; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob57) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate5)
	(at pallet2 distributor1)
	(clear crate8)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 386)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 383)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 3)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 38)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 70)
	(at crate3 distributor0)
	(on crate3 crate1)
	(= (weight crate3) 53)
	(at crate4 depot0)
	(on crate4 crate2)
	(= (weight crate4) 82)
	(at crate5 distributor0)
	(on crate5 crate3)
	(= (weight crate5) 84)
	(at crate6 distributor1)
	(on crate6 pallet2)
	(= (weight crate6) 82)
	(at crate7 depot0)
	(on crate7 crate4)
	(= (weight crate7) 33)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 19)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 crate6)
		(on crate2 crate7)
		(on crate3 pallet1)
		(on crate4 crate0)
		(on crate6 crate3)
		(on crate7 crate1)
		(on crate8 pallet2)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 0 to 10
   goals met: 0 of 8
2. (lift hoist2 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate6)
   added: (lifting hoist2 crate8) (clear crate6)
   changed: (fuel-cost) from 10 to 11
   goals met: 0 of 8
3. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 19
   goals met: 0 of 8
4. (lift hoist2 crate6 pallet2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 8
5. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 19 to 101
   goals met: 0 of 8
6. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 101 to 82
   goals met: 0 of 8
7. (lift hoist1 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 8
8. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 84
   goals met: 0 of 8
9. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 8
10. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 82 to 0
   goals met: 0 of 8
11. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 8
12. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 8
13. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 33
   goals met: 0 of 8
14. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate2)
   added: (lifting hoist0 crate4) (clear crate2)
   changed: (fuel-cost) from 34 to 35
   goals met: 0 of 8
15. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 33 to 115
   goals met: 0 of 8
16. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 35 to 36
   goals met: 0 of 8
17. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 115 to 185
   goals met: 0 of 8
18. (drop hoist2 crate8 pallet2 distributor1)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 pallet2)
   goals met: 1 of 8
19. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 36 to 46
   goals met: 1 of 8
20. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 84 to 166
   goals met: 1 of 8
21. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 185 to 152
   goals met: 1 of 8
22. (drop hoist1 crate7 crate3 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate3)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate3)
   goals met: 1 of 8
23. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 152 to 82
   goals met: 1 of 8
24. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 46 to 56
   goals met: 1 of 8
25. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 56 to 57
   goals met: 1 of 8
26. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 82 to 85
   goals met: 1 of 8
27. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 57 to 67
   goals met: 1 of 8
28. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 85 to 82
   goals met: 1 of 8
29. (drop hoist2 crate0 crate8 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate8)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate8)
   goals met: 2 of 8
30. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 82 to 0
   goals met: 2 of 8
31. (drop hoist2 crate4 crate0 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate0)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate0)
   goals met: 3 of 8
32. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 166 to 236
   goals met: 3 of 8
33. (lift hoist1 crate7 crate3 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate3)
   added: (lifting hoist1 crate7) (clear crate3)
   changed: (fuel-cost) from 67 to 68
   goals met: 3 of 8
34. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 236 to 269
   goals met: 3 of 8
35. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 269 to 187
   goals met: 3 of 8
36. (drop hoist1 crate6 crate3 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate3)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate3)
   goals met: 4 of 8
37. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 187 to 154
   goals met: 4 of 8
38. (drop hoist1 crate7 crate6 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate6)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate6)
   goals met: 4 of 8
39. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 68 to 69
   goals met: 4 of 8
40. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 154 to 187
   goals met: 4 of 8
41. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 69 to 70
   goals met: 3 of 8
42. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 187 to 269
   goals met: 3 of 8
43. (lift hoist1 crate3 crate1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate1)
   added: (lifting hoist1 crate3) (clear crate1)
   changed: (fuel-cost) from 70 to 71
   goals met: 3 of 8
44. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 269 to 322
   goals met: 3 of 8
45. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 71 to 72
   goals met: 3 of 8
46. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 322 to 360
   goals met: 3 of 8
47. (unload hoist1 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck1) from 360 to 307
   goals met: 3 of 8
48. (drop hoist1 crate3 pallet1 distributor0)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 pallet1)
   goals met: 4 of 8
49. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 307 to 225
   goals met: 4 of 8
50. (drop hoist1 crate6 crate3 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate3)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate3)
   goals met: 5 of 8
51. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 225 to 192
   goals met: 5 of 8
52. (drop hoist1 crate7 crate6 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate6)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate6)
   goals met: 5 of 8
53. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 72 to 73
   goals met: 5 of 8
54. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 192 to 225
   goals met: 5 of 8
55. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck1) from 225 to 187
   goals met: 5 of 8
56. (drop hoist1 crate1 crate6 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate6)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate6)
   goals met: 6 of 8
57. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 187 to 154
   goals met: 6 of 8
58. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate1)
   goals met: 7 of 8
59. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 154 to 84
   goals met: 7 of 8
60. (drop hoist1 crate2 crate7 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate7)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate7)
   goals met: 8 of 8
